0x01-challenge/blog/app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body, :online))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "online" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["online", false], ["updated_at", 2019-10-06 05:24:07 UTC], ["id", 2]]